src/main/java/com/amdocs/halo/automation/xmls/CNOD_UNI_CHFIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://CustomerOrderEstablishment.ocxGenericServices.services.amdocs.com">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-E9831C5131DB1C636214604451108501">
            <wsse:Username>OMS</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Oms111</wsse:Password>
            <!--wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">vAMoAVTyRHWrqnMzZjAWBw==</wsse:Nonce>
            <wsu:Created>2016-04-12T07:11:50.847Z</wsu:Created-->
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <cus:createProductOrderForExistingProduct>
         <createProductOrderForExistingProductRequest>
            <salesChannel>SS</salesChannel>
            <options>
               <confirmationChecksApproved>true</confirmationChecksApproved>
            </options>
            <order>
                <customer>
                  <customerId>89291271010</customerId>
                  <organizationId>1115130</organizationId>
                  <contractId>3305329</contractId>
                  <customerName>Sagar Test CR193632</customerName>
                  <saartId>SAART11040</saartId>
                  <customerType>CORP</customerType>
               </customer>
               <description>FIS Add</description>
               <startOrderingProcess>true</startOrderingProcess>
               <topLevelProducts>
                  <associationSpec>
                     <assignedProductId>{$apId$}</assignedProductId>
                  </associationSpec>
                  <orderItem>
                     <contacts>
                        <city>TX</city>
                        <contactType>CUS</contactType>
                        <email>bhausaheb.mugle@amdocs.com</email>
                        <firstName>Bhausaheb</firstName>
                        <landLinePhone>123458</landLinePhone>
                        <lastName>Mugle</lastName>
                        <mobilePhone>9822251448</mobilePhone>
                     </contacts>
                     <contacts>
                        <contactType>BUS</contactType>
                        <email>hs1650@att.com</email>
                        <firstName>Sagar</firstName>
                        <landLinePhone>7736878847</landLinePhone>
                        <lastName>Patankar</lastName>
                        <mobilePhone>9856987747</mobilePhone>
                     </contacts>
                     <contacts>
                        <contactType>ALT</contactType>
                        <email>hs1650@att.com</email>
                        <firstName>Sagar</firstName>
                        <landLinePhone>7736878847</landLinePhone>
                        <lastName>Patankar</lastName>
                        <mobilePhone>9856987747</mobilePhone>
                     </contacts>
                     <contacts>
                        <contactType>LCL</contactType>
                        <email>hs1650@att.com</email>
                        <firstName>Sagar</firstName>
                        <landLinePhone>7736878847</landLinePhone>
                        <lastName>Patankar</lastName>
                        <mobilePhone>9856987747</mobilePhone>
                     </contacts>
                     <PromoCode>
                        <promoCode>PRM112</promoCode>
                        <billingDiscountId>12345</billingDiscountId>
                        <rateId>RATE123</rateId>
                        <discountAmount>111</discountAmount>
                     </PromoCode>
                     <PromoCode>
                        <promoCode>PRM113</promoCode>
                        <billingDiscountId>12345</billingDiscountId>
                        <rateId>RATE124</rateId>
                        <discountAmount>222</discountAmount>
                     </PromoCode>
                     <PromoCode>
                        <promoCode>PRM114</promoCode>
                        <billingDiscountId>12645</billingDiscountId>
                        <rateId>RATE125</rateId>
                        <discountAmount>333</discountAmount>
                     </PromoCode>
                     <PromoCode>
                        <promoCode>PRM115</promoCode>
                        <billingDiscountId>12335</billingDiscountId>
                        <rateId>RATE114</rateId>
                        <discountAmount>444</discountAmount>
                     </PromoCode>
                     <orderActionType>CH</orderActionType>
                     <orderItemAttributes>
                        <orderActionPurpose>CHFIS</orderActionPurpose>
                     </orderItemAttributes>
                     <serviceAdddress>
                        <locationId>GLID001</locationId>
                        <city>CHGO</city>
                        <country>US</country>
                        <houseNumber>554</houseNumber>
                        <isoCountryCode>IL</isoCountryCode>
                        <stateName>554</stateName>
                        <state>IL</state>
                        <streetName>Diversey</streetName>
                        <zipCode>60614-11</zipCode>
                        <clli8>CHCMILVWN00</clli8>
                     </serviceAdddress>
                     <serviceRequiredDate>2020-11-30T23:59:59+02:00</serviceRequiredDate>
                  </orderItem>
                  <topLevelProduct>
                     <containedProducts>
                        <action>CHANGE</action>
                        <associationSpecDefinition>
                           <componentServiceType>PORT</componentServiceType>
                        </associationSpecDefinition>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>CIRSpeed</attributeCode>
                           </characteristicDefinition>
                           <value>100</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>fisArrangement</attributeCode>
                              <attributeId>6040405</attributeId>
                           </characteristicDefinition>
                           <value>ADX</value>
                        </characteristicValues>
                     </containedProducts>
                  </topLevelProduct>
               </topLevelProducts>
               <startOrderingProcess>false</startOrderingProcess>
            </order>
         </createProductOrderForExistingProductRequest>
      </cus:createProductOrderForExistingProduct>
   </soapenv:Body>
</soapenv:Envelope>